; domain
(define(domain puzzle)
    (:predicates
        (at ?frog ?node)
        (visited ?node)
        (line ?node1 ?node2)
    )
    (:action jump
        :parameters (?from ?to ?frog)
        :precondition
            (and
                (at ?frog ?from)
                (not
                    (visited ?to)
                )
                (line ?from ?to)
            )
        :effect
            (and
                (visited ?to)
                (at ?frog ?to)
                (not
                    (at ?frog ?from)    
                )
            )
    )
)

; problem
(define(problem prob)
    (:domain puzzle)
    (:objects   frog
                node11 node12 node13 node14 node15 
                node21 node22 node23 node24 node25 
                node31 node32 node33 node34 node35 
                node41 node42 node43 node44 node45
                node51 node52 node53 node54 node55)
    (:init
        (at frog node42)(visited node42)
        (line node11 node12)(line node11 node13)(line node11 node14)(line node11 node15)
        (line node11 node21)(line node11 node31)(line node11 node41)(line node11 node51)
        
        (line node12 node11)(line node12 node13)(line node12 node14)(line node12 node15)
        (line node12 node22)(line node12 node32)(line node12 node42)(line node12 node52)
        
        (line node13 node11)(line node13 node12)(line node13 node14)(line node13 node15)
        (line node13 node23)(line node13 node33)(line node13 node43)(line node13 node53)
        

        (line node14 node11)(line node14 node12)(line node14 node13)(line node14 node15)
        (line node14 node24)(line node14 node34)(line node14 node44)(line node14 node54)

        (line node15 node11)(line node15 node12)(line node15 node13)(line node15 node14)
        (line node15 node25)(line node15 node35)(line node15 node45)(line node15 node55)

        (line node21 node22)(line node21 node23)(line node21 node24)(line node21 node25)
        (line node21 node11)(line node21 node31)(line node21 node41)(line node21 node51)

        (line node22 node21)(line node22 node23)(line node22 node24)(line node22 node25)
        (line node22 node12)(line node22 node32)(line node22 node42)(line node22 node52)

        (line node23 node21)(line node23 node22)(line node23 node24)(line node23 node25)
        (line node23 node13)(line node23 node33)(line node23 node43)(line node23 node53)

        (line node24 node21)(line node24 node22)(line node24 node23)(line node24 node25)
        (line node24 node14)(line node24 node34)(line node24 node44)(line node24 node54)

        (line node25 node21)(line node25 node22)(line node25 node23)(line node25 node24)
        (line node25 node15)(line node25 node35)(line node25 node45)(line node25 node55)

        (line node31 node32)(line node31 node33)(line node31 node34)(line node31 node35)
        (line node31 node11)(line node31 node21)(line node31 node41)(line node31 node51)

        (line node32 node31)(line node32 node33)(line node32 node34)(line node32 node35)
        (line node32 node12)(line node32 node22)(line node32 node42)(line node32 node52)

        (line node33 node31)(line node33 node32)(line node33 node34)(line node33 node35)
        (line node33 node13)(line node33 node23)(line node33 node43)(line node33 node53)

        (line node34 node31)(line node34 node32)(line node34 node33)(line node34 node35)
        (line node34 node14)(line node34 node24)(line node34 node44)(line node34 node54)

        (line node35 node31)(line node35 node32)(line node35 node33)(line node35 node34)
        (line node35 node15)(line node35 node25)(line node35 node45)(line node35 node55)

        (line node41 node42)(line node41 node43)(line node41 node44)(line node41 node45)
        (line node41 node11)(line node41 node21)(line node41 node31)(line node41 node51)
        
        (line node42 node41)(line node42 node43)(line node42 node44)(line node42 node45)
        (line node42 node12)(line node42 node22)(line node42 node32)(line node42 node52)

        (line node43 node41)(line node43 node42)(line node43 node44)(line node43 node45)
        (line node43 node13)(line node43 node23)(line node43 node33)(line node43 node53)

        (line node44 node41)(line node44 node42)(line node44 node43)(line node44 node45)
        (line node44 node14)(line node44 node24)(line node44 node34)(line node44 node54)

        (line node45 node41)(line node45 node42)(line node45 node43)(line node45 node44)
        (line node45 node15)(line node45 node25)(line node45 node35)(line node45 node55)

        (line node51 node52)(line node51 node53)(line node51 node54)(line node51 node55)
        (line node51 node11)(line node51 node21)(line node51 node31)(line node51 node41)

        (line node52 node51)(line node52 node53)(line node52 node54)(line node52 node55)
        (line node52 node12)(line node52 node22)(line node52 node32)(line node52 node42)

        (line node53 node51)(line node53 node52)(line node53 node54)(line node53 node55)
        (line node53 node13)(line node53 node23)(line node53 node33)(line node53 node43)

        (line node54 node51)(line node54 node52)(line node54 node53)(line node54 node55)
        (line node54 node14)(line node54 node24)(line node54 node34)(line node54 node44)

        (line node55 node51)(line node55 node52)(line node55 node53)(line node55 node54)
        (line node55 node15)(line node55 node25)(line node55 node35)(line node55 node45)
    )
    (:goal
        (and
            (visited node11)
            (visited node12)
            (visited node13)
            (visited node14)
            (not
                (visited node15)
            )
            (not
                (visited node21)
            )
            (visited node22)
            (not
                (visited node23)
            )
            (not
                (visited node24)
            )
            (visited node25)
            (visited node31)
            (visited node32)
            (visited node33)
            (visited node34)
            (not
                (visited node35)
            )
            (visited node41)
            (visited node42)
            (visited node43)
            (visited node44)
            (visited node45)
            (visited node51)
            (visited node52)
            (visited node53)
            (visited node54)
            (visited node55)
        )
    )
)

; plan
1. (jump node42 node52 frog)
   deleted: (at frog node42)
   added: (visited node52) (at frog node52)
   goals met: 7 of 25
2. (jump node52 node53 frog)
   deleted: (at frog node52)
   added: (visited node53) (at frog node53)
   goals met: 8 of 25
3. (jump node53 node33 frog)
   deleted: (at frog node53)
   added: (visited node33) (at frog node33)
   goals met: 9 of 25
4. (jump node33 node31 frog)
   deleted: (at frog node33)
   added: (visited node31) (at frog node31)
   goals met: 10 of 25
5. (jump node31 node11 frog)
   deleted: (at frog node31)
   added: (visited node11) (at frog node11)
   goals met: 11 of 25
6. (jump node11 node14 frog)
   deleted: (at frog node11)
   added: (visited node14) (at frog node14)
   goals met: 12 of 25
7. (jump node14 node44 frog)
   deleted: (at frog node14)
   added: (visited node44) (at frog node44)
   goals met: 13 of 25
8. (jump node44 node45 frog)
   deleted: (at frog node44)
   added: (visited node45) (at frog node45)
   goals met: 14 of 25
9. (jump node45 node25 frog)
   deleted: (at frog node45)
   added: (visited node25) (at frog node25)
   goals met: 15 of 25
10. (jump node25 node22 frog)
   deleted: (at frog node25)
   added: (visited node22) (at frog node22)
   goals met: 16 of 25
11. (jump node22 node12 frog)
   deleted: (at frog node22)
   added: (visited node12) (at frog node12)
   goals met: 17 of 25
12. (jump node12 node13 frog)
   deleted: (at frog node12)
   added: (visited node13) (at frog node13)
   goals met: 18 of 25
13. (jump node13 node43 frog)
   deleted: (at frog node13)
   added: (visited node43) (at frog node43)
   goals met: 19 of 25
14. (jump node43 node41 frog)
   deleted: (at frog node43)
   added: (visited node41) (at frog node41)
   goals met: 20 of 25
15. (jump node41 node51 frog)
   deleted: (at frog node41)
   added: (visited node51) (at frog node51)
   goals met: 21 of 25
16. (jump node51 node55 frog)
   deleted: (at frog node51)
   added: (visited node55) (at frog node55)
   goals met: 22 of 25
17. (jump node55 node54 frog)
   deleted: (at frog node55)
   added: (visited node54) (at frog node54)
   goals met: 23 of 25
18. (jump node54 node34 frog)
   deleted: (at frog node54)
   added: (visited node34) (at frog node34)
   goals met: 24 of 25
19. (jump node34 node32 frog)
   deleted: (at frog node34)
   added: (visited node32) (at frog node32)
   goals met: 25 of 25
